emoji = ['😀', '😬', '😁', '😂', '😃', '👿', '😈', '😴', '🤧', '🤢', '🤮', '🤒', '🤕', '😷', '🤐',
         '🤯', '😲', '😵', '🤩', '😭', '😓', '🤤', '😪', '😥', '😢', '😧', '😦', '😄', '🤣', '😅',
         '😆', '😇', '😉', '😊', '🙂', '🙃', '☺', '😋', '😌', '😍', '😘', '😗', '😙', '😚', '🤪',
         '😜', '😝', '😛', '🤑', '😎', '🤓', '🧐', '🤠', '🤗', '🤡', '😏', '😶', '😐', '😑', '😒',
         '🙄', '🤨', '🤔', '🤫', '🤭', '🤥', '😳', '😞', '😟', '😠', '😡', '🤬', '😔', '😕', '🙁',
         '☹', '😣', '😖', '😫', '😩', '😤', '😮', '😱', '😨', '😰', '😯', '😦', '😧', '😢', '😥',
         '😪', '🤤', '😓', '😭', '🤩', '💤', '😈', '👿', '👹', '👺', '💩', '👻', '💀', '☠', '👽',
         '🤖', '🎃', '😺', '😸', '😹', '😻', '😼', '😽', '🙀', '😿', '👐', '😾', '🤲', '🙌', '👏',
         '🙏', '🤝', '👍', '👎', '👊', '✊', '🤛', '🤜', '🤞', '✌', '🤘', '🤟', '👌', '👈', '👉',
         '👆', '👇', '☝', '✋', '🤚', '🖐', '🖖', '👋', '🤙', '💪', '🖕', '✍', '🤳', '💅', '👄',
         '👅', '👂', '👃', '👁', '👀', '🧠', '👤', '👥', '🗣', '👶', '🧒', '👦', '👧', '🧑', '👨',
         '🧔', '👱', '‍♂', '👩', '👱', '🧓', '👴', '👵']

quotes = ['Трудности похожи на собак: они кусают лишь тех, кто к ним не привык... - Антисфен.',
          'Когда долго начинаешь всматриваться в пропасть – пропасть начинает всматриваться в тебя. - Ницше.',
          'Найти любовь проще, чем стать тем человеком, которого ищут.',
          'Желание - это тысяча способов, нежелание - это тысяча препятствий.',
          'Обиженные люди обижают людей. И все равно любите их. Хотя никто не запрещает вам любить их на расстоянии.',
          'Не злись на идиотов. Они так и останутся идиотами, а ты потеряешь самообладание. - Мэри Хиггинс Кларк.',
          'Очень опасно встретить женщину, которая полностью тебя понимает. '
          'Это обычно кончается женитьбой. - Оскар Уайльд.',
          'Чтобы дойти до цели, надо прежде всего идти. - Оноре де Бальзак.',
          'Если вы идете через ад, идите не останавливаясь. - Уинстон Черчилль.',
          'Лишь очень немногие живут сегодняшним днем. Большинство готовится жить позднее. - Джонатан Свифт.',
          'Если Бог откладывает, то это еще не значит, что он отказывает.',
          'В любой непонятной ситуации — ложись спать. - Еврейская мудрость.',
          'Не переживай о многом, и ты переживёшь многих.',
          'В жизни все временно. Так что, если все идет хорошо, наслаждайся–вечно не продлится. '
          'А если все идет плохо – не переживай, это не продлится вечно.',
          'История учит нас по меньшей мере тому, что хуже может быть всегда.',
          'Самое ужасное, это ожидание того, чего не будет.',
          'Люди думают, что будут счастливы, если переедут в другое место, '
          'а потом оказывается: куда бы ты ни переехал, ты берешь с собой себя.',
          'Умный человек иногда торопится, но никогда не делает ничего второпях.',
          'Ненависть — месть труса за испытанный им страх. - Бернард Шоу.',
          'Те люди, которые чаще всего прощали и дольше всего терпели, обычно уходят неожиданно и навсегда...',
          'Постарайтесь получить то, что любите, иначе придется полюбить то, что получили. - Бернард Шоу.',
          'Никогда не делай выводов о человеке, пока не узнаешь причины его поступков.']

doges = ['Это нормально уйти из чьей-то жизни, если чувствуешь, что ты больше не часть её.'
         'За вcю историю человечества женщины отвоевали у мужчин брюки, короткие стрижки, галстуки, возможность '
         'работать и водить машину, а мужчины забрали себе правo сидеть и ждать, кoгда их кто-нибудь добьётся.',
         'Ценить надо тех мужчин, с которыми чувствуешь себя женщиной, а не пациенткой психиатрической клиники.',
         'Женщинa никогдa не yходит быстро. Она cнaчала пытaется выяcнить причины, исправить, спaсти, одним словом.'
         ' И только когдa все испробовано - она собирает волю в кулак и yходит. Если ваc внезапно покинули '
         '- вы просто cлишком долго были cлепым и глухим и тaк ничего и не поняли.',
         'Не стoит пытаться yдержать кого-то. Нe стоит peвновать к кому-тo. Пoверь, '
         'ведь если чeловеку хоpoшо с тобой, тo он никyда не уйдет.',
         'Будь горда и свободна, как львица... И такой оставайся всегда! '
         'Будь себе и раба, и царица... Но рабою других - никогда!',
         'Знаете, что меня удивляет в последнее время? Ни-че-го!',
         'Лучшее в жизни, когда вот выйдешь вечером подышать свежим воздухом, а возвращаешься под утро пьяная.',
         'Я думала, 2018 год истощил меня окончательно, но 2019 уже успел показать мне новые возможности ужаса, '
         'которой может произойти',
         'Я же не архитектор, чтобы планы строить. Захотелось шампанского, значит всё, внеплановая ситуация.',
         'Женщина - это когда у тебя всe хорошо весело целый день, '
         'а потом ты плачешь из-за какого-то мужика, а он может быть даже не твоим.']

groups = ['Б07-801', 'Б07-802', 'Б07-803',
          'Б06-801', 'Б06-802', 'Б06-803', 'Б06-804', 'Б06-805', 'Б06-806',
          'Б05-811', 'Б05-812', 'Б05-813',	'Б05-814', 'Б05-831', 'Б05-821',
          'Б05-822', 'Б05-823',	 'Б05-824', 'Б05-825', 'Б05-826', 'Б05-827',
          'Б05-871', 'Б05-872', 'Б05-873', 'Б05-874', 'Б05-875', 'Б05-876', 'Б05-877', 'Б05-878', 'Б05-879',
          'Б04-852', 'Б04-853', 'Б04-854', 'Б04-855', 'Б04-856', 'Б04-841', 'Б04-842', 'Б04-843 ',
          'Б03-861', 'Б03-862', 'Б03-863', 'Б03-864', 'Б03-865', 'Б03-831',
          'Б03-832', 'Б03-833', 'Б03-834', 'Б03-835',	'Б03-836',	'Б03-837',	'Б03-838',
          'Б02-881', 'Б02-882', 'Б02-883',	'Б02-884', 'Б02-885', 'Б02-886',
          'Б02-821', 'Б02-822', 'Б02-823',	'Б02-824', 'Б02-825', 'Б02-826', 'Б02-827', 'Б02-828', 'Б02-829',	'Б02-820',
          'Б01-811', 'Б01-812', 'Б01-813',	'Б01-814', 'Б01-815', 'Б01-816', 'Б01-817', 'Б01-818',	'С01-819'
          ]
